Repository: puthsitha/emt
Catalog: lib/l10n/arb/app_*.arb
Languages: km

# tmie_manager
source: Timer Manager
km: គ្រប់គ្រងពេលវាលាធ្វើការ

source: Pause All
km: សម្រាក់ទាំងអស់

source: Resume All
km: បន្តទាំងអស់

source: Stop All
km: បញ្ចប់ទាំងអស់

source: Reset All
km: សម្អាតទាំងអស់

source: Restart All
km: ចាប់ផ្តើមទាំងអស់

source: History
km: ប្រវត្តិ

source: No history yet.
km: មិនមានប្រវត្តិអ្នកឈប់ធ្វើទេ

source: Time
km: រយៈពេល

source: Price
km: ចំនួនលុយ

# riel
source: Riels
km: រៀល

source: Setting
km: ការកំណត់

source: Language
km: ភាសា

source: New Person
km: ថែមអ្នកថ្មី

source: Person Name
km: ឈ្មោះ

source: Name cannot be empty
km: ឈ្មោះមិនអាចទាំងអស់ទេ

# horuly_rate
source: Hourly Rate (Riel)
km: ចំនួនលុយតាមម៉ោង (រៀល)

source: Rate is required
km: ចំនួនលុយត្រូវតែមាន

# rate_must_be_positive_number
source: Rate must be a positive number
km: ចំនួនលុយត្រូវតែជាចំនួនពិតវិជ្ជមាន

source: Cancel
km: បោះបង់

source: Start
km: ចាប់ផ្តើម

source: Delete Person
km: លុបចេញ

# are_you_sure_you_wanna_delete
source: Are you sure you want to delete this person?
km: តើអ្នកពិតជាចង់លុបចេញទេ?

source: Delete
km: លុប

source: Status
km: ស្ថានភាព

source: Total Hours
km: ចំនួនម៉ោងសរុប

source: Total Money
km: ចំនួនលុយសរុប

source: Riels/hour
km: រៀលក្នុង១ម៉ោង

source: Running
km: កំពុងធ្វើការ...

source: Pause
km: សម្រាក់

source: Stop
km: បញ្ចប់

source: Hour
km: ម៉ោង

source: Minute
km: នាទី

source: Second
km: វិនាទី

# press_here_change_language
source: Press here to change language
km: ចុចទីនេះដើម្បីប្តូរភាសា

source: Customize theme appearance
km: ប្ដូររូបរាងកម្មវិធីតាមបំណង

source: Theme
km: ដូរពណ៍កម្មវិធី

source: Call Developer
km: ហៅអ្នកបង្កើតកម្មវិធី

# call_developer_description
source: If you have any question or suggestion, please call me.
km: ប្រសិនបើអ្នកមានសំណួរឬសំណូមពរ

source: Copyright
km: រក្សាសិទ្ធិ

source: Version
km: កំណែទម្រង់

source: Save
km: រក្សាទុក

source: Dark Mode
km: ផ្ទាំងងងឹត

source: Light Mode
km: ផ្ទាំងភ្លឺ

source: System Default
km: ផ្ទាំងដូចទូរស័ព្ទ

# dark_mode_description
source: App look darker.
km: កម្មវិធីនេះនឹងប្រើផ្ទាំងងងឹត

source: Voice
km: សំឡេង

source: Change Voice Sound
km: ផ្តូរសំឡេងនិយាយ

source: Alert
km: ដាស់តឿន

source: Sound Khmer not supported
km: សំឡេងខ្មែរមិនគាំទ្រទេ

# allow_speak
source: Allow to speak
km: អនុញ្ញាតឱ្យនិយាយ

# please_turn_on_permission
source: Please turn on {permissionType} permission
km: សូមបើកការអនុញ្ញាត {permissionType}

# open_setting
source: Open Settings
km: បើកការកំណត់

source: Photo
km: រូបភាព

source: Camera
km: កាមេរ៉ា

# chose_photo
source: Choose Photo
km: ជ្រើសរើសរូបភាព

# take_photo
source: Take a Photo
km: ថតរូប

source: Choose from Library
km: ជ្រើសរើសពីរូបភាព

source: AI Sound
km: សំឡេង AI

# ai_sound_description
source: Allow to use AI voice to speak
km: សំឡេងដែលបានបង្កើតដោយ AI

# update_empolyee
source: Update Employee
km: កែប្រែអ្នកធ្វើការ

source: Update
km: កែប្រែ

# start_timer
source: Time Start
km: ម៉ោងចាប់ផ្តើម

# stop_timer
source: Time Stop
km: ម៉ោងបញ្ចប់
